/*

상수(constant)란
    변수와 마찬가지로 데이터를 저장할 수 있는 메모리 공간이지만
    프로그램이 실행되는 동안 메모리에 저장된 데이터를 변경할 수 없는 차이점이 있습니다.
    상수의 종류로는 리터럴 상수(literal constant), 심볼릭 상수(symboilc constant)가 있습니다.

리터럴 상수(literal constant)란
    변수와는 달리 데이터가 저장된 메모리 공간을 가리키는 이름을 가지고 있지 않습니다.
    타입에 따라 정수형 리터럴 상수, 실수형 리터럴 상수, 문자형 리터럴 상수 등으로 구분할 수 있습니다.
    10, -123, 0.5f, 3.141592, 'A', "word"등이 있습니다.

심볼릭 상수(symbolic constant)
    심볼릭 상수는 변수와 마찬가지로 이름을 가지고 있는 상수입니다.
    심볼릭 상수는 선언과 동시에 반드시 초기화해야 합니다.
    매크로를 이용하거나 const 키워드를 이용하여 선언할 수 있습니다.
    const int ages = 30;(const 키워드를 사용한 경우)
*/
#include <iostream>

int main()
{

    return 0;
}